src/Linux/Linux Command Sheet.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-1.org
#+TITLE: Linux Command Sheet
#+OPTIONS: num:nil H:2

* System 
** Check the CPU info and so on
#+begin_src sh
sudo dmidecode | more 
#+end_src
** =find_host_distribution=
#+begin_src sh
host=`lsb_release -a 2>/dev/null | grep Codename: | awk {'print $2'}`
#+end_src
** ip
#+begin_src sh
ipdefault=`ifconfig | grep 'inet addr:'| grep -v '127.0.0.1' | cut -d:
-f2 | awk '{ print $1 }'`
#+end_src
** set ip
#+begin_src sh
sudo ifconfig eth0 192.168.1.1 netmask 255.255.255.0 up
#+end_src
** set MAC Addr
#+begin_src sh
/sbin/ifconfig eth0 down
/sbin/ifconfig eth0 hw ether xx:xx:xx:xx:xx:xx
/sbin/ifconfig eth0 up
或者
ip link set eth0 down
ip link set eth0 address xx:xx:xx:xx:xx:xx
ip link set eth0 up

Or Edit /etc/rcS.d/rc.local，

or Edit /etc/network/interfaces 
pre-up ifconfig eth0 hw ether xx:xx:xx:xx:xx:xx

#+end_src
* General
** extract
#+begin_src sh
extract () {
   if [ -f $1 ] ; then
       case $1 in
	*.tar.bz2)	tar xvjf $1 && cd $(basename "$1" .tar.bz2) ;;
	*.tar.gz)	tar xvzf $1 && cd $(basename "$1" .tar.gz) ;;
	*.tar.xz)	tar Jxvf $1 && cd $(basename "$1" .tar.xz) ;;
	*.bz2)		bunzip2 $1 && cd $(basename "$1" /bz2) ;;
	*.rar)		unrar x $1 && cd $(basename "$1" .rar) ;;
	*.gz)		gunzip $1 && cd $(basename "$1" .gz) ;;
	*.tar)		tar xvf $1 && cd $(basename "$1" .tar) ;;
	*.tbz2)		tar xvjf $1 && cd $(basename "$1" .tbz2) ;;
	*.tgz)		tar xvzf $1 && cd $(basename "$1" .tgz) ;;
	*.zip)		unzip $1 && cd $(basename "$1" .zip) ;;
	*.Z)		uncompress $1 && cd $(basename "$1" .Z) ;;
	*.7z)		7z x $1 && cd $(basename "$1" .7z) ;;
	*)		echo "don't know how to extract '$1'..." ;;
       esac
   else
       echo "'$1' is not a valid file!"
   fi
 }

#+end_src

* Internet
** FTP Server
#+begin_src sh
sudo apt-get install vsftpd

sudo useradd -m ftp
sudo passwd ftp

sudo chmod 777 /home/ftp
#+end_src
+ Configured Files
=sudo emacs /etc/vsftpd.conf=
#+begin_src sh
#独立模式启动
listen=YES

#同时允许4客户端连入，每个IP最多5个进程
max_clients=200
max_per_ip=4

#不允许匿名用户访问，允许本地（系统）用户登录
anonymous_enable=NO
local_enable=YES
write_enable=NO

#是否采用端口20进行数据传输
connect_from_port_20=YES

#生成日志
xferlog_enable=YES

#指定登录转向目录
local_root=/home/ftp/ftp
#+end_src
+ Run
#+begin_src sh
sudo /etc/init.d/vsftpd start
sudo /etc/init.d/vsftpd stop
#+end_src


* Network
** wireless analysis[fn:1]
#+begin_src sh
cat /etc/lsb-release; uname -a
lspci -nnk | grep -iA2 net
lsusb
iwconfig
rfkill list all
lsmod
#+end_src
*** do:
#+begin_src sh
gksudo gedit /etc/pm/config.d/config

#add one line
SUSPEND_MODULES="iwl3945"
#+end_src

*** after you suspend your computer 
and before you connect the wireless again please post the output of:
#+begin_src sh
rfkill list all
lsmod | grep iwl
dmesg | egrep 'iwl|firm|etork|wlan0'
#+end_src

*** do:
#+begin_src sh
gksudo gedit /etc/modprobe.d/50-iwl3945.conf
# add one line:
options iwl3945 debug=10 disable_hw_scan=0 swcrypto=1
#+end_src


* Footnotes

[fn:1] http://ubuntuforums.org/showthread.php?t=2011612

