public_html/Linux/Linux Command Sheet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Linux Command Sheet</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Linux Command Sheet"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-29T00:47+0800"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Linux Command Sheet</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">System</a>
<ul>
<li><a href="#sec-1-1">Check the CPU info and so on</a></li>
<li><a href="#sec-1-2"><code>find_host_distribution</code></a></li>
<li><a href="#sec-1-3">ip</a></li>
<li><a href="#sec-1-4">set ip</a></li>
<li><a href="#sec-1-5">set MAC Addr</a></li>
</ul>
</li>
<li><a href="#sec-2">General</a>
<ul>
<li><a href="#sec-2-1">extract</a></li>
</ul>
</li>
<li><a href="#sec-3">Internet</a>
<ul>
<li><a href="#sec-3-1">FTP Server</a></li>
</ul>
</li>
<li><a href="#sec-4">Network</a>
<ul>
<li><a href="#sec-4-1">wireless analysis</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">System</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Check the CPU info and so on</h3>
<div class="outline-text-3" id="text-1-1">




<pre class="src src-sh">sudo dmidecode | more 
</pre>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><code>find_host_distribution</code></h3>
<div class="outline-text-3" id="text-1-2">




<pre class="src src-sh"><span style="color: #eedd82;">host</span>=<span style="color: #fa8072;">`lsb_release -a 2&gt;/dev/null | grep Codename: | awk {'print $2'}`</span>
</pre>

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">ip</h3>
<div class="outline-text-3" id="text-1-3">




<pre class="src src-sh"><span style="color: #eedd82;">ipdefault</span>=<span style="color: #fa8072;">`ifconfig | grep 'inet addr:'| grep -v '127.0.0.1' | cut -d:</span>
<span style="color: #fa8072;">-f2 | awk '{ print $1 }'`</span>
</pre>

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">set ip</h3>
<div class="outline-text-3" id="text-1-4">




<pre class="src src-sh">sudo ifconfig eth0 192.168.1.1 netmask 255.255.255.0 up
</pre>

</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5">set MAC Addr</h3>
<div class="outline-text-3" id="text-1-5">




<pre class="src src-sh">/sbin/ifconfig eth0 down
/sbin/ifconfig eth0 hw ether xx:xx:xx:xx:xx:xx
/sbin/ifconfig eth0 up
&#25110;&#32773;
ip link set eth0 down
ip link set eth0 address xx:xx:xx:xx:xx:xx
ip link set eth0 up

Or Edit /etc/rcS.d/rc.local&#65292;

or Edit /etc/network/interfaces 
pre-up ifconfig eth0 hw ether xx:xx:xx:xx:xx:xx

</pre>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">General</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">extract</h3>
<div class="outline-text-3" id="text-2-1">




<pre class="src src-sh"><span style="color: #87cefa;">extract</span> () {
   <span style="color: #00ffff;">if</span> [ -f $<span style="color: #eedd82;">1</span> ] ; <span style="color: #00ffff;">then</span>
       <span style="color: #00ffff;">case</span> $<span style="color: #eedd82;">1</span><span style="color: #00ffff;"> in</span>
        *.tar.bz2)      tar xvjf $<span style="color: #eedd82;">1</span> &amp;&amp; <span style="color: #b0c4de;">cd</span> $(basename <span style="color: #ffa07a;">"$1"</span> .tar.bz2) ;;
        *.tar.gz)       tar xvzf $<span style="color: #eedd82;">1</span> &amp;&amp; <span style="color: #b0c4de;">cd</span> $(basename <span style="color: #ffa07a;">"$1"</span> .tar.gz) ;;
        *.tar.xz)       tar Jxvf $<span style="color: #eedd82;">1</span> &amp;&amp; <span style="color: #b0c4de;">cd</span> $(basename <span style="color: #ffa07a;">"$1"</span> .tar.xz) ;;
        *.bz2)          bunzip2 $<span style="color: #eedd82;">1</span> &amp;&amp; <span style="color: #b0c4de;">cd</span> $(basename <span style="color: #ffa07a;">"$1"</span> /bz2) ;;
        *.rar)          unrar x $<span style="color: #eedd82;">1</span> &amp;&amp; <span style="color: #b0c4de;">cd</span> $(basename <span style="color: #ffa07a;">"$1"</span> .rar) ;;
        *.gz)           gunzip $<span style="color: #eedd82;">1</span> &amp;&amp; <span style="color: #b0c4de;">cd</span> $(basename <span style="color: #ffa07a;">"$1"</span> .gz) ;;
        *.tar)          tar xvf $<span style="color: #eedd82;">1</span> &amp;&amp; <span style="color: #b0c4de;">cd</span> $(basename <span style="color: #ffa07a;">"$1"</span> .tar) ;;
        *.tbz2)         tar xvjf $<span style="color: #eedd82;">1</span> &amp;&amp; <span style="color: #b0c4de;">cd</span> $(basename <span style="color: #ffa07a;">"$1"</span> .tbz2) ;;
        *.tgz)          tar xvzf $<span style="color: #eedd82;">1</span> &amp;&amp; <span style="color: #b0c4de;">cd</span> $(basename <span style="color: #ffa07a;">"$1"</span> .tgz) ;;
        *.zip)          unzip $<span style="color: #eedd82;">1</span> &amp;&amp; <span style="color: #b0c4de;">cd</span> $(basename <span style="color: #ffa07a;">"$1"</span> .zip) ;;
        *.Z)            uncompress $<span style="color: #eedd82;">1</span> &amp;&amp; <span style="color: #b0c4de;">cd</span> $(basename <span style="color: #ffa07a;">"$1"</span> .Z) ;;
        *.7z)           7z x $<span style="color: #eedd82;">1</span> &amp;&amp; <span style="color: #b0c4de;">cd</span> $(basename <span style="color: #ffa07a;">"$1"</span> .7z) ;;
        *)              <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"don't know how to extract '$1'..."</span> ;;
       <span style="color: #00ffff;">esac</span>
   <span style="color: #00ffff;">else</span>
       <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"'$1' is not a valid file!"</span>
   <span style="color: #00ffff;">fi</span>
 }

</pre>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Internet</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">FTP Server</h3>
<div class="outline-text-3" id="text-3-1">




<pre class="src src-sh">sudo apt-get install vsftpd

sudo useradd -m ftp
sudo passwd ftp

sudo chmod 777 /home/ftp
</pre>

<ul>
<li>Configured Files
</li>
</ul>

<p><code>sudo emacs /etc/vsftpd.conf</code>
</p>


<pre class="src src-sh"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">&#29420;&#31435;&#27169;&#24335;&#21551;&#21160;</span>
<span style="color: #eedd82;">listen</span>=YES

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">&#21516;&#26102;&#20801;&#35768;4&#23458;&#25143;&#31471;&#36830;&#20837;&#65292;&#27599;&#20010;IP&#26368;&#22810;5&#20010;&#36827;&#31243;</span>
<span style="color: #eedd82;">max_clients</span>=200
<span style="color: #eedd82;">max_per_ip</span>=4

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">&#19981;&#20801;&#35768;&#21311;&#21517;&#29992;&#25143;&#35775;&#38382;&#65292;&#20801;&#35768;&#26412;&#22320;&#65288;&#31995;&#32479;&#65289;&#29992;&#25143;&#30331;&#24405;</span>
<span style="color: #eedd82;">anonymous_enable</span>=NO
<span style="color: #eedd82;">local_enable</span>=YES
<span style="color: #eedd82;">write_enable</span>=NO

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">&#26159;&#21542;&#37319;&#29992;&#31471;&#21475;20&#36827;&#34892;&#25968;&#25454;&#20256;&#36755;</span>
<span style="color: #eedd82;">connect_from_port_20</span>=YES

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">&#29983;&#25104;&#26085;&#24535;</span>
<span style="color: #eedd82;">xferlog_enable</span>=YES

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">&#25351;&#23450;&#30331;&#24405;&#36716;&#21521;&#30446;&#24405;</span>
<span style="color: #eedd82;">local_root</span>=/home/ftp/ftp
</pre>

<ul>
<li>Run
</li>
</ul>




<pre class="src src-sh">sudo /etc/init.d/vsftpd start
sudo /etc/init.d/vsftpd stop
</pre>



</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Network</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">wireless analysis<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup></h3>
<div class="outline-text-3" id="text-4-1">




<pre class="src src-sh">cat /etc/lsb-release; uname -a
lspci -nnk | grep -iA2 net
lsusb
iwconfig
rfkill list all
lsmod
</pre>

<ul>
<li id="sec-4-1-1">do:<br/>



<pre class="src src-sh">gksudo gedit /etc/pm/config.d/config

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">add one line</span>
<span style="color: #eedd82;">SUSPEND_MODULES</span>=<span style="color: #ffa07a;">"iwl3945"</span>
</pre>


</li>
</ul>
<ul>
<li id="sec-4-1-2">after you suspend your computer<br/>
and before you connect the wireless again please post the output of:



<pre class="src src-sh">rfkill list all
lsmod | grep iwl
dmesg | egrep <span style="color: #ffa07a;">'iwl|firm|etork|wlan0'</span>
</pre>


</li>
</ul>
<ul>
<li id="sec-4-1-3">do:<br/>



<pre class="src src-sh">gksudo gedit /etc/modprobe.d/50-iwl3945.conf
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">add one line:</span>
options iwl3945 <span style="color: #eedd82;">debug</span>=10 <span style="color: #eedd82;">disable_hw_scan</span>=0 <span style="color: #eedd82;">swcrypto</span>=1
</pre>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> <a href="http://ubuntuforums.org/showthread.php?t=2011612">http://ubuntuforums.org/showthread.php?t=2011612</a>
</p>



</li>
</ul>
</div>
</div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-11-29T00:47+0800</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.2+ with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
